Repository: vakesz/Glasstual
Catalog: Sources/App/Localization/Prompts.xcstrings
Source language: en
Languages: de, hu

# action-title-for-accepting-accept
source: Accept
de: Annehmen
hu: Elfogadás

# are-you-sure-you-want-to-open-the-file-named
source: Are you sure you want to open the file named “%@” with Glasstual?
de: Möchtest du die Datei "%@" wirklich mit Glasstual öffnen?
hu: Biztosan megnyitod a(z) "%@" fájlt a Glasstuallal?

source: Are you sure you want to quit Glasstual?
de: Möchtest du Glasstual wirklich beenden?
hu: Biztosan kilépsz a Glasstualból?

source: Cancel
de: Abbrechen
hu: Mégse

# certificate-for-this-server-is-invalid
source: The certificate for this server is invalid. You might be connecting to a server that is pretending to be “%@”, which could put your confidential information at risk. Would you like to connect to the server anyway?
de: Das Zertifikat dieses Servers ist ungültig. Möglicherweise verbindest du dich mit einem Server, der sich als "%@" ausgibt und deine vertraulichen Daten gefährdet. Möchtest du dich trotzdem verbinden?
hu: A kiszolgáló tanúsítványa érvénytelen. Lehet, hogy egy olyan kiszolgálóhoz kapcsolódsz, amely "%@" néven másnak adja ki magát, és veszélyeztetheti a bizalmas adataidat. Ennek ellenére kapcsolódsz?

# certificate-was-not-trusted
source: The certificate was not trusted by the system: %@
de: Das System vertraut dem Zertifikat nicht: %@
hu: A rendszer nem bízik meg a tanúsítványban: %@

source: Choose File
de: Datei auswählen
hu: Fájl kiválasztása

source: Close
de: Schließen
hu: Bezárás

# connection-named-is-already-configured
source: The connection named “%1$@” is already configured to connect to this server address. Do you want to add these channels to that connection or would you rather create a new connection?
de: Die Verbindung "%1$@" ist bereits für diese Serveradresse eingerichtet. Möchtest du diese Kanäle zu dieser Verbindung hinzufügen oder eine neue Verbindung erstellen?
hu: A(z) "%1$@" kapcsolat már ehhez a kiszolgálócímhez van beállítva. Ehhez a kapcsolathoz adod hozzá ezeket a csatornákat, vagy új kapcsolatot hozol létre?

# connection-named-is-already-configured-to-connect-to
source: The connection named “%1$@” is already configured to connect to this server address. Do you want to add this channel to that connection or would you rather create a new connection?
de: Die Verbindung "%1$@" ist bereits für diese Serveradresse eingerichtet. Möchtest du diesen Kanal zu dieser Verbindung hinzufügen oder eine neue Verbindung erstellen?
hu: A(z) "%1$@" kapcsolat már ehhez a kiszolgálócímhez van beállítva. Ehhez a kapcsolathoz adod hozzá ezt a csatornát, vagy új kapcsolatot hozol létre?

source: Continue
de: Fortfahren
hu: Folytatás

# could-not-open-saved-conversation-history
source: Glasstual could not open your saved conversation history. Please report this problem at https://github.com/vakesz/Glasstual/issues
de: Glasstual konnte deinen gespeicherten Gesprächsverlauf nicht öffnen. Bitte melde das Problem unter https://github.com/vakesz/Glasstual/issues
hu: A Glasstual nem tudta megnyitni a mentett beszélgetési előzményeket. Jelentsd a hibát itt: https://github.com/vakesz/Glasstual/issues

source: Create New Connection
de: Neue Verbindung erstellen
hu: Új kapcsolat létrehozása

source: Delete
de: Löschen
hu: Törlés

# direct-chat-dcc-chat-decline
source: Decline
de: Ablehnen
hu: Elutasítás

# direct-chat-request
source: Direct chat request from %@
de: Direkte Chatanfrage von %@
hu: Közvetlen csevegési kérés ettől: %@

source: Do not ask me again
de: Nicht erneut fragen
hu: Ne kérdezze újra

source: Do not show this message again
de: Diese Meldung nicht mehr anzeigen
hu: Ne jelenjen meg újra ez az üzenet

# do-you-want-to-delete-named
source: Do you want to delete “%@”?
de: Möchtest du "%@" löschen?
hu: Törlöd ezt: "%@"?

# encryption-with-a-digital-certificate-keeps
source: Encryption with a digital certificate keeps information private as it’s sent to or from the server “%1$@”
de: Die Verschlüsselung mit einem digitalen Zertifikat schützt die Daten beim Austausch mit dem Server "%1$@"
hu: A digitális tanúsítvánnyal végzett titkosítás megvédi a(z) "%1$@" kiszolgálóval váltott adatokat

# encryption-with-a-digital-certificate-keeps-information
source: Encryption with a digital certificate keeps information private as it’s sent to or from the server “%1$@” Information encrypted using: %2$@
de: Die Verschlüsselung mit einem digitalen Zertifikat schützt die Daten beim Austausch mit dem Server "%1$@" Verwendete Verschlüsselung: %2$@
hu: A digitális tanúsítvánnyal végzett titkosítás megvédi a(z) "%1$@" kiszolgálóval váltott adatokat Az adatok titkosítása: %2$@

# glasstual-cant-verify-the-identity
source: Glasstual can’t verify the identity of the server “%@”
de: Glasstual kann die Identität des Servers "%@" nicht überprüfen
hu: A Glasstual nem tudja ellenőrizni a(z) "%@" kiszolgáló személyazonosságát

# glasstual-is-unable-to-access
source: Glasstual can no longer reach the folder set as its log location.
de: Glasstual kann den als Protokollspeicherort festgelegten Ordner nicht mehr erreichen.
hu: A Glasstual már nem éri el a naplózás célmappáját.

# glasstual-is-using-an-encrypted-connection
source: Glasstual is using an encrypted connection to “%@”
de: Glasstual verwendet eine verschlüsselte Verbindung zu "%@"
hu: A Glasstual titkosított kapcsolatot használ ehhez: "%@"

source: Last known error message: %@
de: Letzte bekannte Fehlermeldung: %@
hu: Legutóbbi ismert hibaüzenet: %@

# logging-has-been-disabled-because-there
source: Logging has been disabled because there is not enough space on your Mac
de: Die Protokollierung wurde deaktiviert, da auf deinem Mac nicht genügend Speicherplatz vorhanden ist
hu: A naplózás letiltva, mert nincs elég szabad hely a Macen

# logging-will-resume-when-there
source: Logging will resume when there is free space available.
de: Die Protokollierung wird fortgesetzt, sobald Speicherplatz verfügbar ist.
hu: A naplózás folytatódik, amint lesz szabad hely.

# navigate-to-preferences-advanced-log-location
source: Choose the folder again in Settings › Advanced › Log Location.
de: Wähle den Ordner unter Einstellungen › Erweitert › Protokollspeicherort erneut aus.
hu: Válaszd ki újra a mappát itt: Beállítások › Haladó › Naplók helye.

source: No
de: Nein
hu: Nem

source: No logs were found
de: Keine Protokolle gefunden
hu: Nem találhatók naplók

source: Open
de: Öffnen
hu: Megnyitás

# please-enter-desired-vhost-e-g
source: Please enter desired vHost (e.g. “apple.vhost”)
de: Gib den gewünschten vHost ein (z. B. "apple.vhost")
hu: Add meg a kívánt virtuális gépnevet (például "apple.vhost")

# please-note-that-the-following-items
source: Please note that the following items cannot be imported: custom addons, file transfer download location, log location, and passwords.
de: Folgende Elemente können nicht importiert werden: eigene Add-ons, Downloadordner für Dateiübertragungen, Protokollspeicherort und Passwörter.
hu: A következő elemek nem importálhatók: egyéni kiegészítők, fájlátviteli letöltések helye, naplók helye és jelszavak.

# please-note-that-the-following-items-cannot-be-exported
source: Please note that the following items cannot be exported: custom addons, file transfer download location, log location, and passwords.
de: Folgende Elemente können nicht exportiert werden: eigene Add-ons, Downloadordner für Dateiübertragungen, Protokollspeicherort und Passwörter.
hu: A következő elemek nem exportálhatók: egyéni kiegészítők, fájlátviteli letöltések helye, naplók helye és jelszavak.

# query-named-already-exists-do
source: A query named “%@” already exists. Do you want to delete this query?
de: Ein Gespräch namens "%@" ist bereits vorhanden. Möchtest du dieses Gespräch löschen?
hu: Már létezik "%@" nevű privát beszélgetés. Törlöd ezt a beszélgetést?

source: Quit
de: Beenden
hu: Kilépés

# quitting-will-disconnect-you-from-any
source: Quitting will disconnect you from any server that you are connected to until you restart Glasstual.
de: Beim Beenden werden alle Serververbindungen getrennt, bis du Glasstual erneut startest.
hu: Kilépéskor minden kiszolgálóval megszakad a kapcsolat a Glasstual következő indításáig.

source: Remove
de: Entfernen
hu: Eltávolítás

source: Save
de: Sichern
hu: Mentés

source: Save File
de: Datei sichern
hu: Fájl mentése

# script-named-has-been-successfully-installed
source: The script named “%@” has been successfully installed
de: Das Skript "%@" wurde erfolgreich installiert
hu: A(z) "%@" szkript telepítése sikerült

# scrollback-database-could-not-be-opened
source: The scrollback database could not be opened.
de: Die Verlaufsdatenbank konnte nicht geöffnet werden.
hu: Nem sikerült megnyitni az előzményadatbázist.

source: Select
de: Auswählen
hu: Kiválasztás

source: Send
de: Senden
hu: Küldés

source: Set User vHost
de: Benutzer-vHost festlegen
hu: Felhasználó virtuális gépnevének beállítása

# the-preferences-could-not-be-imported
source: The settings could not be imported.
de: Die Einstellungen konnten nicht importiert werden.
hu: Nem sikerült importálni a beállításokat.

# the-selected-file-is-not-a-preferences-file
source: The selected file is not a Glasstual settings file.
de: Die ausgewählte Datei ist keine Glasstual-Einstellungsdatei.
hu: A kiválasztott fájl nem Glasstual-beállításfájl.

# there-is-no-undo-and-all
source: There is no undo and all data related to this channel, except for logs, will be erased.
de: Dies kann nicht rückgängig gemacht werden. Alle Daten dieses Kanals außer den Protokollen werden gelöscht.
hu: Ez nem vonható vissza. A naplók kivételével a csatornához tartozó összes adat törlődik.

# there-is-no-undo-and-all-2
source: There is no undo and all data related to this server, except for logs, will be erased.
de: Dies kann nicht rückgängig gemacht werden. Alle Daten dieses Servers außer den Protokollen werden gelöscht.
hu: Ez nem vonható vissza. A naplók kivételével a kiszolgálóhoz tartozó összes adat törlődik.

# there-is-no-undo-and-all-data-related
source: There is no undo and all data related to this query, except for logs, will be erased.
de: Dies kann nicht rückgängig gemacht werden. Alle Daten dieses Gesprächs außer den Protokollen werden gelöscht.
hu: Ez nem vonható vissza. A naplók kivételével a privát beszélgetéshez tartozó összes adat törlődik.

# this-action-will-overwrite-your-configuration
source: This action will overwrite your configuration with the contents of a file you choose
de: Dieser Vorgang überschreibt deine Konfiguration mit dem Inhalt einer ausgewählten Datei
hu: Ez a művelet felülírja a beállításaidat a kiválasztott fájl tartalmával

# this-action-will-save-a-copy
source: This action will save a copy of your configuration to a location of your choice
de: Dieser Vorgang sichert eine Kopie deiner Konfiguration an einem Ort deiner Wahl
hu: Ez a művelet másolatot ment a beállításaidról a választott helyre

# type-into-the-main-input-text
source: Type “/%@” into the main input text field to perform this script.
de: Gib /%@ in das Haupteingabefeld ein, um dieses Skript auszuführen.
hu: A szkript futtatásához írd be a fő szövegbeviteli mezőbe: /%@

source: Use Existing Connection
de: Vorhandene Verbindung verwenden
hu: Meglévő kapcsolat használata

# wants-to-start-a-direct-chat
source: %@ wants to start a direct chat with you. A direct chat is a connection between the two of you that does not go through the IRC server, so the other person will learn your IP address.
de: %@ möchte einen direkten Chat mit dir starten. Dabei entsteht eine direkte Verbindung zwischen euch, die nicht über den IRC-Server läuft. Die andere Person erfährt dadurch deine IP-Adresse.
hu: %@ közvetlen csevegést szeretne indítani veled. Ez közvetlen kapcsolat kettőtök között, amely nem az IRC-kiszolgálón keresztül zajlik, így a másik fél megismeri az IP-címedet.

# with-the-cipher-suite
source: %1$@ with the cipher suite: %2$@
de: %1$@ mit der Cipher-Suite: %2$@
hu: %1$@, titkosítási csomag: %2$@

# with-the-cipher-suite-deprecated
source: %1$@ with the cipher suite: %2$@ (deprecated)
de: %1$@ mit der Cipher-Suite: %2$@ (veraltet)
hu: %1$@, titkosítási csomag: %2$@ (elavult)

source: Yes
de: Ja
hu: Igen

# you-have-clicked-a-link
source: You have clicked a link that will connect you to “%1$@” and join the channel %2$@
de: Du hast auf einen Link geklickt, der dich mit "%1$@" verbindet und dem Kanal %2$@ beitritt
hu: Olyan hivatkozásra kattintottál, amely ehhez kapcsolódik: "%1$@", és csatlakozik a(z) %2$@ csatornához

# you-have-clicked-a-link-that-will-connect
source: You have clicked a link that will connect you to “%1$@” and join the channels: %2$@
de: Du hast auf einen Link geklickt, der dich mit "%1$@" verbindet und folgenden Kanälen beitritt: %2$@
hu: Olyan hivatkozásra kattintottál, amely ehhez kapcsolódik: "%1$@", és csatlakozik ezekhez a csatornákhoz: %2$@

# your-current-preferences-could-not-be-backed-up
source: Your current settings could not be backed up, so nothing was changed.
de: Deine aktuellen Einstellungen konnten nicht gesichert werden. Daher wurde nichts geändert.
hu: Nem sikerült biztonsági mentést készíteni a jelenlegi beállításokról, ezért semmi sem változott.

# keychain-quit-save-failed-body
source: Some password changes have not been saved. Try again before quitting, or quit without saving these changes.
de: Einige Passwortänderungen wurden nicht gesichert. Versuche es vor dem Beenden erneut oder beende die App ohne diese Änderungen zu sichern.
hu: Néhány jelszómódosítás nem lett elmentve. Próbáld újra kilépés előtt, vagy lépj ki ezek mentése nélkül.

# keychain-quit-without-saving
source: Quit Without Saving
de: Ohne Sichern beenden
hu: Kilépés mentés nélkül

# keychain-save-failed-title
source: Passwords could not be saved
de: Passwörter konnten nicht gesichert werden
hu: Nem sikerült menteni a jelszavakat

# keychain-retry-save
source: Try Again
de: Erneut versuchen
hu: Újrapróbálkozás
